[Killed] BlockStatement
src/operacoes.js:33:27
 }
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
-function maximoArray(arr) {
-  if (!arr || arr.length === 0) throw new Error('Array vazio não permitido');
-  return Math.max(...arr);
-}
+function maximoArray(arr) {}
 function minimoArray(arr) {
   if (!arr || arr.length === 0) throw new Error('Array vazio não possui valor mínimo.');
killedBy: Suíte de Testes Completa para Operações Aritméticas maximoArray lança erro se vazio
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/operacoes.js:34:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(arr) {
-  if (!arr || arr.length === 0) throw new Error('Array vazio não permitido');
+  if (false) throw new Error('Array vazio não permitido');
   return Math.max(...arr);
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas maximoArray lança erro se vazio
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/operacoes.js:34:15
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(arr) {
-  if (!arr || arr.length === 0) throw new Error('Array vazio não permitido');
+  if (!arr || arr.length !== 0) throw new Error('Array vazio não permitido');
   return Math.max(...arr);
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas maximoArray lança erro se vazio
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Survived] MethodExpression
src/operacoes.js:35:10
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(arr) {
   if (!arr || arr.length === 0) throw new Error('Array vazio não permitido');
-  return Math.max(...arr);
+  return Math.min(...arr);
 }
 function minimoArray(arr) {

[Killed] BlockStatement
src/operacoes.js:37:27
   if (!arr || arr.length === 0) throw new Error('Array vazio não permitido');
   return Math.max(...arr);
 }
-function minimoArray(arr) {
-  if (!arr || arr.length === 0) throw new Error('Array vazio não possui valor mínimo.');
-  return Math.min(...arr);
-}
+function minimoArray(arr) {}
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
killedBy: Suíte de Testes Completa para Operações Aritméticas minimoArray lança erro se vazio
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/operacoes.js:38:15
   return Math.max(...arr);
 }
 function minimoArray(arr) {
-  if (!arr || arr.length === 0) throw new Error('Array vazio não possui valor mínimo.');
+  if (!arr || false) throw new Error('Array vazio não possui valor mínimo.');
   return Math.min(...arr);
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas minimoArray lança erro se vazio
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/operacoes.js:38:7
   return Math.max(...arr);
 }
 function minimoArray(arr) {
-  if (!arr || arr.length === 0) throw new Error('Array vazio não possui valor mínimo.');
+  if (false) throw new Error('Array vazio não possui valor mínimo.');
   return Math.min(...arr);
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas minimoArray lança erro se vazio
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] MethodExpression
src/operacoes.js:39:10
 }
 function minimoArray(arr) {
   if (!arr || arr.length === 0) throw new Error('Array vazio não possui valor mínimo.');
-  return Math.min(...arr);
+  return Math.max(...arr);
 }
 function valorAbsoluto(n) { return Math.abs(n); }
killedBy: Suíte de Testes Completa para Operações Aritméticas minimoArray normal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 100

[Killed] BlockStatement
src/operacoes.js:46:49
 function isPar(n) { return n % 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
-function aumentarPorcentagem(valor, percentual) { 
-  return Number((valor * (1 + percentual / 100)).toPrecision(12)); 
-}
+function aumentarPorcentagem(valor, percentual) {}
 function diminuirPorcentagem(valor, percentual) { 
   return Number((valor * (1 - percentual / 100)).toPrecision(12)); 
killedBy: Suíte de Testes Completa para Operações Aritméticas aumentarPorcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:47:27
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { 
-  return Number((valor * (1 + percentual / 100)).toPrecision(12)); 
+  return Number((valor * (1 - percentual / 100)).toPrecision(12)); 
 }
 function diminuirPorcentagem(valor, percentual) { 
killedBy: Suíte de Testes Completa para Operações Aritméticas aumentarPorcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 110
Received: 90

Expected precision:    2
Expected difference: < 0.005
Received difference:   20

[Killed] ArithmeticOperator
src/operacoes.js:47:18
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { 
-  return Number((valor * (1 + percentual / 100)).toPrecision(12)); 
+  return Number((valor / (1 + percentual / 100)).toPrecision(12)); 
 }
 function diminuirPorcentagem(valor, percentual) { 
killedBy: Suíte de Testes Completa para Operações Aritméticas aumentarPorcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 110
Received: 90.9090909091

Expected precision:    2
Expected difference: < 0.005
Received difference:   19.0909090909

[Killed] BlockStatement
src/operacoes.js:49:49
 function aumentarPorcentagem(valor, percentual) { 
   return Number((valor * (1 + percentual / 100)).toPrecision(12)); 
 }
-function diminuirPorcentagem(valor, percentual) { 
-  return Number((valor * (1 - percentual / 100)).toPrecision(12)); 
-}
+function diminuirPorcentagem(valor, percentual) {}
 function inverterSinal(n) { return -n; }
 
killedBy: Suíte de Testes Completa para Operações Aritméticas diminuirPorcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:50:18
   return Number((valor * (1 + percentual / 100)).toPrecision(12)); 
 }
 function diminuirPorcentagem(valor, percentual) { 
-  return Number((valor * (1 - percentual / 100)).toPrecision(12)); 
+  return Number((valor / (1 - percentual / 100)).toPrecision(12)); 
 }
 function inverterSinal(n) { return -n; }
killedBy: Suíte de Testes Completa para Operações Aritméticas diminuirPorcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 90
Received: 111.111111111

Expected precision:    2
Expected difference: < 0.005
Received difference:   21.111111111

[Killed] ArithmeticOperator
src/operacoes.js:50:27
   return Number((valor * (1 + percentual / 100)).toPrecision(12)); 
 }
 function diminuirPorcentagem(valor, percentual) { 
-  return Number((valor * (1 - percentual / 100)).toPrecision(12)); 
+  return Number((valor * (1 + percentual / 100)).toPrecision(12)); 
 }
 function inverterSinal(n) { return -n; }
killedBy: Suíte de Testes Completa para Operações Aritméticas diminuirPorcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 90
Received: 110

Expected precision:    2
Expected difference: < 0.005
Received difference:   20

[Killed] BlockStatement
src/operacoes.js:52:27
 function diminuirPorcentagem(valor, percentual) { 
   return Number((valor * (1 - percentual / 100)).toPrecision(12)); 
 }
-function inverterSinal(n) { return -n; }
+function inverterSinal(n) {}
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
killedBy: Suíte de Testes Completa para Operações Aritméticas inverterSinal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: undefined

[Killed] UnaryOperator
src/operacoes.js:52:36
 function diminuirPorcentagem(valor, percentual) { 
   return Number((valor * (1 - percentual / 100)).toPrecision(12)); 
 }
-function inverterSinal(n) { return -n; }
+function inverterSinal(n) { return +n; }
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
killedBy: Suíte de Testes Completa para Operações Aritméticas inverterSinal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: 42

[Killed] ArithmeticOperator
src/operacoes.js:62:52
 function logaritmoBase10(n) { return Math.log10(n); }
 function arredondarParaBaixo(n) { return Math.floor(n); }
 function arredondarParaCima(n) { return Math.ceil(n); }
-function hipotenusa(a, b) { return Math.sqrt(a*a + b*b); }
+function hipotenusa(a, b) { return Math.sqrt(a*a + b / b); }
 function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
killedBy: Suíte de Testes Completa para Operações Aritméticas hipotenusa
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 5
Received: 3.1622776601683795

Expected precision:    2
Expected difference: < 0.005
Received difference:   1.8377223398316205

[Killed] BlockStatement
src/operacoes.js:62:27
 function logaritmoBase10(n) { return Math.log10(n); }
 function arredondarParaBaixo(n) { return Math.floor(n); }
 function arredondarParaCima(n) { return Math.ceil(n); }
-function hipotenusa(a, b) { return Math.sqrt(a*a + b*b); }
+function hipotenusa(a, b) {}
 function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
killedBy: Suíte de Testes Completa para Operações Aritméticas hipotenusa
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:63:53
 function arredondarParaBaixo(n) { return Math.floor(n); }
 function arredondarParaCima(n) { return Math.ceil(n); }
 function hipotenusa(a, b) { return Math.sqrt(a*a + b*b); }
-function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
+function grausParaRadianos(graus) { return graus * (Math.PI * 180); }
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
 
killedBy: Suíte de Testes Completa para Operações Aritméticas grausParaRadianos
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 3.141592653589793
Received: 101787.6019763093

Expected precision:    2
Expected difference: < 0.005
Received difference:   101784.46038365572

[Killed] ArithmeticOperator
src/operacoes.js:63:44
 function arredondarParaBaixo(n) { return Math.floor(n); }
 function arredondarParaCima(n) { return Math.ceil(n); }
 function hipotenusa(a, b) { return Math.sqrt(a*a + b*b); }
-function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
+function grausParaRadianos(graus) { return graus / (Math.PI / 180); }
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
 
killedBy: Suíte de Testes Completa para Operações Aritméticas grausParaRadianos
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 3.141592653589793
Received: 10313.240312354817

Expected precision:    2
Expected difference: < 0.005
Received difference:   10310.098719701227

[Killed] ConditionalExpression
src/operacoes.js:67:28
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
-function mdc(a, b) { while(b) { [a, b] = [b, a % b]; } return a; }
+function mdc(a, b) { while(false) { [a, b] = [b, a % b]; } return a; }
 function mmc(a, b) { return (a * b) / mdc(a, b); }
 function isPrimo(n) {
killedBy: Suíte de Testes Completa para Operações Aritméticas MDC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] BlockStatement
src/operacoes.js:67:20
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
-function mdc(a, b) { while(b) { [a, b] = [b, a % b]; } return a; }
+function mdc(a, b) {}
 function mmc(a, b) { return (a * b) / mdc(a, b); }
 function isPrimo(n) {
killedBy: Suíte de Testes Completa para Operações Aritméticas MDC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/operacoes.js:68:20
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) { while(b) { [a, b] = [b, a % b]; } return a; }
-function mmc(a, b) { return (a * b) / mdc(a, b); }
+function mmc(a, b) {}
 function isPrimo(n) {
   if (n <= 1) return false;
killedBy: Suíte de Testes Completa para Operações Aritméticas MMC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:68:30
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) { while(b) { [a, b] = [b, a % b]; } return a; }
-function mmc(a, b) { return (a * b) / mdc(a, b); }
+function mmc(a, b) { return (a / b) / mdc(a, b); }
 function isPrimo(n) {
   if (n <= 1) return false;
killedBy: Suíte de Testes Completa para Operações Aritméticas MMC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0.4

[Killed] BlockStatement
src/operacoes.js:69:21
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) { while(b) { [a, b] = [b, a % b]; } return a; }
 function mmc(a, b) { return (a * b) / mdc(a, b); }
-function isPrimo(n) {
-  if (n <= 1) return false;
-  for (let i = 2; i < n; i++) if (n % i === 0) return false;
-  return true;
-}
+function isPrimo(n) {}
 function fibonacci(n) {
   if (n <= 1) return n;
killedBy: Suíte de Testes Completa para Operações Aritméticas isPrimo true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:71:19
 function mmc(a, b) { return (a * b) / mdc(a, b); }
 function isPrimo(n) {
   if (n <= 1) return false;
-  for (let i = 2; i < n; i++) if (n % i === 0) return false;
+  for (let i = 2; i >= n; i++) if (n % i === 0) return false;
   return true;
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas isPrimo false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/operacoes.js:71:35
 function mmc(a, b) { return (a * b) / mdc(a, b); }
 function isPrimo(n) {
   if (n <= 1) return false;
-  for (let i = 2; i < n; i++) if (n % i === 0) return false;
+  for (let i = 2; i < n; i++) if (false) return false;
   return true;
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas isPrimo false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/operacoes.js:72:10
 function isPrimo(n) {
   if (n <= 1) return false;
   for (let i = 2; i < n; i++) if (n % i === 0) return false;
-  return true;
+  return false;
 }
 function fibonacci(n) {
killedBy: Suíte de Testes Completa para Operações Aritméticas isPrimo true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:87:42
   if (valor > max) return max;
   return valor;
 }
-function isDivisivel(dividendo, divisor) {
-  if (divisor === 0) throw new Error('Divisão por zero não é permitida.');
-  return dividendo % divisor === 0;
-}
+function isDivisivel(dividendo, divisor) {}
 function celsiusParaFahrenheit(c) { return (c * 9/5) + 32; }
 function fahrenheitParaCelsius(f) { return (f - 32) * 5/9; }
killedBy: Suíte de Testes Completa para Operações Aritméticas isDivisivel
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:88:7
   return valor;
 }
 function isDivisivel(dividendo, divisor) {
-  if (divisor === 0) throw new Error('Divisão por zero não é permitida.');
+  if (false) throw new Error('Divisão por zero não é permitida.');
   return dividendo % divisor === 0;
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas isDivisivel
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Divisão por zero não é permitida."

Received function did not throw

[Killed] ConditionalExpression
src/operacoes.js:88:7
   return valor;
 }
 function isDivisivel(dividendo, divisor) {
-  if (divisor === 0) throw new Error('Divisão por zero não é permitida.');
+  if (true) throw new Error('Divisão por zero não é permitida.');
   return dividendo % divisor === 0;
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas isDivisivel
statusReason: Error: Divisão por zero não é permitida.

[Killed] ArithmeticOperator
src/operacoes.js:89:10
 }
 function isDivisivel(dividendo, divisor) {
   if (divisor === 0) throw new Error('Divisão por zero não é permitida.');
-  return dividendo % divisor === 0;
+  return dividendo * divisor === 0;
 }
 function celsiusParaFahrenheit(c) { return (c * 9/5) + 32; }
killedBy: Suíte de Testes Completa para Operações Aritméticas isDivisivel
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:89:10
 }
 function isDivisivel(dividendo, divisor) {
   if (divisor === 0) throw new Error('Divisão por zero não é permitida.');
-  return dividendo % divisor === 0;
+  return false;
 }
 function celsiusParaFahrenheit(c) { return (c * 9/5) + 32; }
killedBy: Suíte de Testes Completa para Operações Aritméticas isDivisivel
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/operacoes.js:91:45
   if (divisor === 0) throw new Error('Divisão por zero não é permitida.');
   return dividendo % divisor === 0;
 }
-function celsiusParaFahrenheit(c) { return (c * 9/5) + 32; }
+function celsiusParaFahrenheit(c) { return (c * 9 * 5) + 32; }
 function fahrenheitParaCelsius(f) { return (f - 32) * 5/9; }
 function inverso(n) {
killedBy: Suíte de Testes Completa para Operações Aritméticas celsiusParaFahrenheit
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 212
Received: 4532

Expected precision:    2
Expected difference: < 0.005
Received difference:   4320

[Killed] ArithmeticOperator
src/operacoes.js:91:44
   if (divisor === 0) throw new Error('Divisão por zero não é permitida.');
   return dividendo % divisor === 0;
 }
-function celsiusParaFahrenheit(c) { return (c * 9/5) + 32; }
+function celsiusParaFahrenheit(c) { return c * 9 / 5 - 32; }
 function fahrenheitParaCelsius(f) { return (f - 32) * 5/9; }
 function inverso(n) {
killedBy: Suíte de Testes Completa para Operações Aritméticas celsiusParaFahrenheit
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 32
Received: -32

Expected precision:    2
Expected difference: < 0.005
Received difference:   64

[Killed] ArithmeticOperator
src/operacoes.js:92:44
   return dividendo % divisor === 0;
 }
 function celsiusParaFahrenheit(c) { return (c * 9/5) + 32; }
-function fahrenheitParaCelsius(f) { return (f - 32) * 5/9; }
+function fahrenheitParaCelsius(f) { return (f - 32) * 5 * 9; }
 function inverso(n) {
   if (n === 0) throw new Error('Não é possível inverter o número zero.');
killedBy: Suíte de Testes Completa para Operações Aritméticas fahrenheitParaCelsius
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 100
Received: 8100

Expected precision:    2
Expected difference: < 0.005
Received difference:   8000

[Killed] ArithmeticOperator
src/operacoes.js:92:44
   return dividendo % divisor === 0;
 }
 function celsiusParaFahrenheit(c) { return (c * 9/5) + 32; }
-function fahrenheitParaCelsius(f) { return (f - 32) * 5/9; }
+function fahrenheitParaCelsius(f) { return (f - 32) / 5/9; }
 function inverso(n) {
   if (n === 0) throw new Error('Não é possível inverter o número zero.');
killedBy: Suíte de Testes Completa para Operações Aritméticas fahrenheitParaCelsius
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 100
Received: 4

Expected precision:    2
Expected difference: < 0.005
Received difference:   96

[Killed] BlockStatement
src/operacoes.js:93:21
 }
 function celsiusParaFahrenheit(c) { return (c * 9/5) + 32; }
 function fahrenheitParaCelsius(f) { return (f - 32) * 5/9; }
-function inverso(n) {
-  if (n === 0) throw new Error('Não é possível inverter o número zero.');
-  return 1 / n;
-}
+function inverso(n) {}
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
killedBy: Suíte de Testes Completa para Operações Aritméticas inverso
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:99:34
 }
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
-function areaCirculo(r) { return Math.PI * r*r; }
+function areaCirculo(r) { return Math.PI * r / r; }
 function areaRetangulo(b, h) { return b * h; }
 function perimetroRetangulo(b, h) { return 2*(b + h); }
killedBy: Suíte de Testes Completa para Operações Aritméticas areaCirculo
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 314.159
Received: 3.141592653589793

Expected precision:    3
Expected difference: < 0.0005
Received difference:   311.0174073464102

[Killed] BlockStatement
src/operacoes.js:99:25
 }
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
-function areaCirculo(r) { return Math.PI * r*r; }
+function areaCirculo(r) {}
 function areaRetangulo(b, h) { return b * h; }
 function perimetroRetangulo(b, h) { return 2*(b + h); }
killedBy: Suíte de Testes Completa para Operações Aritméticas areaCirculo
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:100:39
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(r) { return Math.PI * r*r; }
-function areaRetangulo(b, h) { return b * h; }
+function areaRetangulo(b, h) { return b / h; }
 function perimetroRetangulo(b, h) { return 2*(b + h); }
 function isMaiorQue(a, b) { return a > b; }
killedBy: Suíte de Testes Completa para Operações Aritméticas areaRetangulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 1.25

[Killed] BlockStatement
src/operacoes.js:100:30
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(r) { return Math.PI * r*r; }
-function areaRetangulo(b, h) { return b * h; }
+function areaRetangulo(b, h) {}
 function perimetroRetangulo(b, h) { return 2*(b + h); }
 function isMaiorQue(a, b) { return a > b; }
killedBy: Suíte de Testes Completa para Operações Aritméticas areaRetangulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:101:44
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(r) { return Math.PI * r*r; }
 function areaRetangulo(b, h) { return b * h; }
-function perimetroRetangulo(b, h) { return 2*(b + h); }
+function perimetroRetangulo(b, h) { return 2 / (b + h); }
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
killedBy: Suíte de Testes Completa para Operações Aritméticas perimetroRetangulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: 0.2222222222222222

[Killed] BlockStatement
src/operacoes.js:101:35
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(r) { return Math.PI * r*r; }
 function areaRetangulo(b, h) { return b * h; }
-function perimetroRetangulo(b, h) { return 2*(b + h); }
+function perimetroRetangulo(b, h) {}
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
killedBy: Suíte de Testes Completa para Operações Aritméticas perimetroRetangulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:102:36
 function areaCirculo(r) { return Math.PI * r*r; }
 function areaRetangulo(b, h) { return b * h; }
 function perimetroRetangulo(b, h) { return 2*(b + h); }
-function isMaiorQue(a, b) { return a > b; }
+function isMaiorQue(a, b) { return a <= b; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
killedBy: Suíte de Testes Completa para Operações Aritméticas isMaiorQue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:102:36
 function areaCirculo(r) { return Math.PI * r*r; }
 function areaRetangulo(b, h) { return b * h; }
 function perimetroRetangulo(b, h) { return 2*(b + h); }
-function isMaiorQue(a, b) { return a > b; }
+function isMaiorQue(a, b) { return false; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
killedBy: Suíte de Testes Completa para Operações Aritméticas isMaiorQue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:105:28
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
-function medianaArray(arr) {
-  if (!arr || arr.length === 0) throw new Error('Array vazio não possui mediana.');
-  const sorted = [...arr].sort((a,b) => a-b);
-  const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) return (sorted[mid-1] + sorted[mid])/2;
-  return sorted[mid];
-}
+function medianaArray(arr) {}
 function dobro(n) { return n*2; }
 function triplo(n) { return n*3; }
killedBy: Suíte de Testes Completa para Operações Aritméticas medianaArray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:106:7
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(arr) {
-  if (!arr || arr.length === 0) throw new Error('Array vazio não possui mediana.');
+  if (false) throw new Error('Array vazio não possui mediana.');
   const sorted = [...arr].sort((a,b) => a-b);
   const mid = Math.floor(sorted.length / 2);
killedBy: Suíte de Testes Completa para Operações Aritméticas medianaArray
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio não possui mediana."

Received function did not throw

[Killed] ConditionalExpression
src/operacoes.js:106:15
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(arr) {
-  if (!arr || arr.length === 0) throw new Error('Array vazio não possui mediana.');
+  if (!arr || false) throw new Error('Array vazio não possui mediana.');
   const sorted = [...arr].sort((a,b) => a-b);
   const mid = Math.floor(sorted.length / 2);
killedBy: Suíte de Testes Completa para Operações Aritméticas medianaArray
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio não possui mediana."

Received function did not throw

[Survived] ArrowFunction
src/operacoes.js:107:32
 function isEqual(a, b) { return a === b; }
 function medianaArray(arr) {
   if (!arr || arr.length === 0) throw new Error('Array vazio não possui mediana.');
-  const sorted = [...arr].sort((a,b) => a-b);
+  const sorted = [...arr].sort(() => undefined);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) return (sorted[mid-1] + sorted[mid])/2;

[Survived] ArithmeticOperator
src/operacoes.js:107:41
 function isEqual(a, b) { return a === b; }
 function medianaArray(arr) {
   if (!arr || arr.length === 0) throw new Error('Array vazio não possui mediana.');
-  const sorted = [...arr].sort((a,b) => a-b);
+  const sorted = [...arr].sort((a,b) => a + b);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) return (sorted[mid-1] + sorted[mid])/2;

[Killed] ArithmeticOperator
src/operacoes.js:108:26
 function medianaArray(arr) {
   if (!arr || arr.length === 0) throw new Error('Array vazio não possui mediana.');
   const sorted = [...arr].sort((a,b) => a-b);
-  const mid = Math.floor(sorted.length / 2);
+  const mid = Math.floor(sorted.length * 2);
   if (sorted.length % 2 === 0) return (sorted[mid-1] + sorted[mid])/2;
   return sorted[mid];
killedBy: Suíte de Testes Completa para Operações Aritméticas medianaArray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined
