[Killed] ConditionalExpression
src/operacoes.js:109:7
   if (!arr || arr.length === 0) throw new Error('Array vazio não possui mediana.');
   const sorted = [...arr].sort((a,b) => a-b);
   const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) return (sorted[mid-1] + sorted[mid])/2;
+  if (false) return (sorted[mid-1] + sorted[mid])/2;
   return sorted[mid];
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas medianaArray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 3

[Killed] ArithmeticOperator
src/operacoes.js:109:40
   if (!arr || arr.length === 0) throw new Error('Array vazio não possui mediana.');
   const sorted = [...arr].sort((a,b) => a-b);
   const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) return (sorted[mid-1] + sorted[mid])/2;
+  if (sorted.length % 2 === 0) return (sorted[mid - 1] - sorted[mid])/2;
   return sorted[mid];
 }
killedBy: Suíte de Testes Completa para Operações Aritméticas medianaArray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: -0.5
